In [1]:
for i in range(5, -1, -1):
  for j in range(1, i+1):
    print('*', end=" ")
  print()

* * * * *
* * * *
* * *
* *
*

In [2]:
row = 7
for i in range(1, row):
  print("  "*(row-i), end="")
  print(" *  "*i)

             *
           *   *
         *   *   *
       *   *   *   *
     *   *   *   *   *
   *   *   *   *   *   *

In [3]:
def add(a, b):
  return a + b

print(add(10, 20))

30

In [4]:
user_list = [1,2,2,2,2, 3,3,3, 4,45, 5,5, 3]

res_dict = {}
def find_mod(arr=[]):
  for i in arr:
    if i not in res_dict:
      res_dict[i] = arr.count(i)

find_mod(user_list)
print(res_dict)
m = max(res_dict.values())
print(m)

res = [k for k, v in res_dict.items() if v == m]
print(res)

{1: 1, 2: 4, 3: 4, 4: 1, 45: 1, 5: 2}
4
[2, 3]

In [5]:
add = lambda x, y: x + y
print(add(10,50))

60

In [6]:
check_palindrom = lambda x: True if x == x[::-1] else False
check_palindrom('aaa')

True

In [7]:
!pip install pandas

Requirement already satisfied: pandas in /Volumes/Technology/pesu/sem_one/python/git/python-for-datascience/.conda/lib/python3.11/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.23.2 in /Volumes/Technology/pesu/sem_one/python/git/python-for-datascience/.conda/lib/python3.11/site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in /Volumes/Technology/pesu/sem_one/python/git/python-for-datascience/.conda/lib/python3.11/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Volumes/Technology/pesu/sem_one/python/git/python-for-datascience/.conda/lib/python3.11/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /Volumes/Technology/pesu/sem_one/python/git/python-for-datascience/.conda/lib/python3.11/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /Volumes/Technology/pesu/sem_one/python/git/python-for-datascience/.conda/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [8]:
import pandas as pd

In [9]:
a = {
  "name": ["Tej", "Nag", "Kull"],
  "age": [25, 31, 1],
  "gender": ["F", "M", "M"]
}

In [10]:
type(a)

dict

In [11]:
a

{'name': ['Tej', 'Nag', 'Kull'], 'age': [25, 31, 1], 'gender': ['F', 'M', 'M']}

In [12]:
data = pd.DataFrame(a)

In [13]:
data

   name  age gender
0   Tej   25      F
1   Nag   31      M
2  Kull    1      M

In [14]:
data.iloc[0,1]

np.int64(25)

In [15]:
data.loc[1,"age"]

np.int64(31)

In [16]:
data = pd.DataFrame(a, index=['a','b','c'])

In [17]:
data

   name  age gender
a   Tej   25      F
b   Nag   31      M
c  Kull    1      M

In [18]:
data.loc["a","age"] = 26

In [19]:
data

   name  age gender
a   Tej   26      F
b   Nag   31      M
c  Kull    1      M

In [20]:
data.iloc[1]

name      Nag
age        31
gender      M
Name: b, dtype: object

In [21]:
data[data.age > 20]

  name  age gender
a  Tej   26      F
b  Nag   31      M

In [22]:
type(data)

pandas.core.frame.DataFrame

In [23]:
data.loc["a", "name"]

'Tej'

In [24]:
data["name"]

a     Tej
b     Nag
c    Kull
Name: name, dtype: object

In [25]:
data

   name  age gender
a   Tej   26      F
b   Nag   31      M
c  Kull    1      M

In [27]:
data[['age', 'name']]

   age  name
a   26   Tej
b   31   Nag
c    1  Kull

In [40]:
data

   name  age gender
a   Tej   26      F
b   Nag   31      M
c  Kull    1      M

In [41]:
data.iloc[1,2]

'M'

In [42]:
for i in data:
  print(i)

name
age
gender

In [43]:
data.age

a    26
b    31
c     1
Name: age, dtype: int64

In [44]:
data

   name  age gender
a   Tej   26      F
b   Nag   31      M
c  Kull    1      M

In [45]:
data.iloc[1]

name      Nag
age        31
gender      M
Name: b, dtype: object

In [47]:
data.loc['b']

name      Nag
age        31
gender      M
Name: b, dtype: object

In [48]:
data.index

Index(['a', 'b', 'c'], dtype='object')

In [49]:
data.columns

Index(['name', 'age', 'gender'], dtype='object')

In [ ]:
type(data.index) # pandas.core.indexes.base.Index
type(data.columns) # pandas.core.indexes.base.Index

pandas.core.indexes.base.Index

In [53]:
list(data.columns)

['name', 'age', 'gender']

In [55]:
for i in data.index:
  print(i)

a
b
c

In [57]:
data["age"] = data['age'] + 2

In [58]:
data

   name  age gender
a   Tej   28      F
b   Nag   33      M
c  Kull    3      M

In [59]:
new_data = pd.DataFrame(data={
  'name': 'elan',
  'age': 50,
  'gender': 'M'
}, index=['d'])

In [60]:
new_data

   name  age gender
d  elan   50      M

In [61]:
data

   name  age gender
a   Tej   28      F
b   Nag   33      M
c  Kull    3      M

In [62]:
pd.concat([data, new_data], copy=False)

   name  age gender
a   Tej   28      F
b   Nag   33      M
c  Kull    3      M
d  elan   50      M

In [63]:
pd.concat([data, new_data], copy=False, axis=1)

   name   age gender  name   age gender
a   Tej  28.0      F   NaN   NaN    NaN
b   Nag  33.0      M   NaN   NaN    NaN
c  Kull   3.0      M   NaN   NaN    NaN
d   NaN   NaN    NaN  elan  50.0      M